[
  "Segmentation fault",
  "Potatoes are good",
  "Toxeus magnus, a type of jumping spider native to Southeast Asia, can produce a nutritious milk-like substance containing about four times as much protein as cow's milk.",
  "Kefir is a drink made from fermented milk, similar to yogurt. Drinking kefir can help improve digestion and metabolism in general and bone health. It is also low in lactose, and can improve your lactose digestion and tolerance.",
  "As of August 2024, Twitch has over 140 million monthly active users, while YouTube has 2.70 billion.",
  "Dragonflies see around 200 images per second and have a 360° eyesight. Their reaction time is 50 ms, compared to 250 ms for humans. When hunting, dragonflies compute an interception flight path, instead of simply flying towards the current location of the prey.",
  "Autostereograms are 2D images that can be perceived as 3D when viewed in a particular way. By converging your eyes behind the image plane, you can trick your brain into matching different elements of the image, as seen by the left and right eyes, as if they belonged to a single object. The distance between the elements controls the perceived displacement of the object when seen through different eyes, and in turn controls the perceived depth. This illusion is also known as the \"Magic Eye\" illusion because of the book series featuring it.",
  "Normally, humans distinguish color with the use of three classes of cone cells in our retina, which are most sensitive to different parts of the spectrum, usually designated L, M and S for long, medium and short wavelengths respectively (or red, green and blue). This is called trichromacy. The genes for two of the cone photopigments are encoded in the X chromosome, and mutations to those genes can cause a shift in the cone sensitivity, leading to deficiencies of color vision. Carriers of both a normal and a mutated X chromosome, due to random X chromosome deactivation, can sometimes have a mosaic of four types of cone cells in their retinas. However, it is still unclear whether the brain can make use of this extra color channel to differentiate a wider variety of colors, which would make the person a tetrachromat.",
  "The list of animals that can mimic human speech, besides commonly known parrots, also includes ravens, lyrebirds and apparently a seal.",
  "Stop looking at the screen and do some eye exercises! For example, look at an object at least 20 feet away for 20 seconds."
]
